In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [3]:
obj = pd.Series([3, -4, 2, 8])

In [4]:
obj

0    3
1   -4
2    2
3    8
dtype: int64

In [5]:
obj.values

array([ 3, -4,  2,  8])

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([3, -4, 2, 8], index = ['a', 'b', 'c', 'd'])

In [9]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [10]:
obj2['b']

np.int64(-4)

In [11]:
obj2[['b','c']]

b   -4
c    2
dtype: int64

In [12]:
obj2[obj2>0]

a    3
c    2
d    8
dtype: int64

In [13]:
obj2 * 3

a     9
b   -12
c     6
d    24
dtype: int64

In [16]:
import numpy as np

In [17]:
np.exp(obj2)

a      20.085537
b       0.018316
c       7.389056
d    2980.957987
dtype: float64

In [18]:
'c' in obj2

True

In [19]:
'g' in obj2

False

In [23]:
data = {'Math':100, 'English':98, 'Art':85}

In [24]:
obj3 = pd.Series(data)

In [25]:
obj3

Math       100
English     98
Art         85
dtype: int64

In [29]:
code = ['Art', 'Math', 'Chinese']

In [30]:
obj4 = pd.Series(data, index=code)

In [31]:
obj4

Art         85.0
Math       100.0
Chinese      NaN
dtype: float64

In [32]:
pd.isnull(obj4)

Art        False
Math       False
Chinese     True
dtype: bool

In [33]:
pd.notnull(obj4)

Art         True
Math        True
Chinese    False
dtype: bool

In [34]:
obj3 + obj4

Art        170.0
Chinese      NaN
English      NaN
Math       200.0
dtype: float64

In [35]:
obj4.name = 'Score'

In [36]:
obj4.index.name = 'Subject'

In [37]:
obj4

Subject
Art         85.0
Math       100.0
Chinese      NaN
Name: Score, dtype: float64

In [38]:
obj.index = ['a', 'b', 'c', 'd']

In [39]:
obj

a    3
b   -4
c    2
d    8
dtype: int64

In [40]:
data = {'ID':[1, 2, 3, 4],'Score':[100, 70, 75, 80], 'Rank':[1, 4, 3, 2]}

In [41]:
frame = pd.DataFrame(data)

In [42]:
frame

   ID  Score  Rank
0   1    100     1
1   2     70     4
2   3     75     3
3   4     80     2

In [43]:
frame.head(3)

   ID  Score  Rank
0   1    100     1
1   2     70     4
2   3     75     3

In [45]:
pd.DataFrame(data, columns = ['ID', 'Rank', 'Score'])

   ID  Rank  Score
0   1     1    100
1   2     4     70
2   3     3     75
3   4     2     80

In [46]:
frame2 = pd.DataFrame(data, columns = ['ID', 'Rank', 'Score', 'Class'])

In [47]:
frame2

   ID  Rank  Score Class
0   1     1    100   NaN
1   2     4     70   NaN
2   3     3     75   NaN
3   4     2     80   NaN

In [48]:
frame2['Score']

0    100
1     70
2     75
3     80
Name: Score, dtype: int64

In [50]:
frame2.loc[2]

ID         3
Rank       3
Score     75
Class    NaN
Name: 2, dtype: object

In [61]:
frame2['Class'] = np.arange(1,5,1)

In [62]:
frame2

   ID  Rank  Score  Class
0   1     1    100      1
1   2     4     70      2
2   3     3     75      3
3   4     2     80      4

In [65]:
frame2['PhD'] = frame2.ID == 2

In [66]:
frame2

   ID  Rank  Score  Class    PhD
0   1     1    100      1  False
1   2     4     70      2   True
2   3     3     75      3  False
3   4     2     80      4  False

In [67]:
del frame2['PhD']

In [68]:
frame2.columns

Index(['ID', 'Rank', 'Score', 'Class'], dtype='object')

In [69]:
data2 = {'Score':{1:100, 2:85, 3:90},'Rank':{1:1, 2:3, 3:2}}

In [72]:
frame3 = pd.DataFrame(data2)

In [73]:
frame3

   Score  Rank
1    100     1
2     85     3
3     90     2

In [74]:
frame3.T

         1   2   3
Score  100  85  90
Rank     1   3   2

In [76]:
frame3.index.name = 'ID'; frame3.columns.name = 'Performance'

In [77]:
frame3

Performance  Score  Rank
ID
1              100     1
2               85     3
3               90     2

In [78]:
frame3.values

array([[100,   1],
       [ 85,   3],
       [ 90,   2]])

In [80]:
lable = pd.Index(np.arange(3))

In [81]:
lable

Index([0, 1, 2], dtype='int64')

In [82]:
obj = pd.Series([3.23, 1.12, 9.22], index = lable)

In [83]:
obj

0    3.23
1    1.12
2    9.22
dtype: float64

In [84]:
obj = pd.Series([3, 5, -2, 1], index = ['c', 'd', 'a', 'b'])

In [85]:
obj

c    3
d    5
a   -2
b    1
dtype: int64

In [86]:
obj2 = obj.reindex(['a', 'b', 'c', 'd'])

In [87]:
obj2

a   -2
b    1
c    3
d    5
dtype: int64

In [88]:
obj3 = pd.Series(['cake', 'scone', 'bread'], index = [1, 3, 6])

In [89]:
obj3

1     cake
3    scone
6    bread
dtype: object

In [90]:
obj3.reindex(range(7))

0      NaN
1     cake
2      NaN
3    scone
4      NaN
5      NaN
6    bread
dtype: object

In [91]:
obj3.reindex(range(7), method = 'ffill')

0      NaN
1     cake
2     cake
3    scone
4    scone
5    scone
6    bread
dtype: object

In [93]:
obj3.reindex(range(7), method = 'bfill')

0     cake
1     cake
2    scone
3    scone
4    bread
5    bread
6    bread
dtype: object

In [94]:
frame = pd.DataFrame (np.arange(9).reshape((3,3)), index = ['c', 'a', 'b'], columns = ['Chi', 'Math', 'Eng'])

In [95]:
frame

   Chi  Math  Eng
c    0     1    2
a    3     4    5
b    6     7    8

In [96]:
frame.reindex(['a', 'b', 'c'])

   Chi  Math  Eng
a    3     4    5
b    6     7    8
c    0     1    2

In [97]:
frame.reindex(columns = ['Eng', 'Chi', 'Math'])

   Eng  Chi  Math
c    2    0     1
a    5    3     4
b    8    6     7

In [98]:
frame.drop('b')

   Chi  Math  Eng
c    0     1    2
a    3     4    5

In [99]:
frame.drop('Math', axis=1)

   Chi  Eng
c    0    2
a    3    5
b    6    8

In [100]:
obj = pd.Series([1, 2, 3, 4], index= ['a', 'b', 'c', 'd'])

In [101]:
obj

a    1
b    2
c    3
d    4
dtype: int64

In [102]:
obj[1:3]

b    2
c    3
dtype: int64

In [103]:
obj['b':'c']

b    2
c    3
dtype: int64

In [104]:
obj['b':'c']=5

In [105]:
obj

a    1
b    5
c    5
d    4
dtype: int64

In [106]:
frame[frame['Chi']>0]

   Chi  Math  Eng
a    3     4    5
b    6     7    8

In [107]:
frame>5

     Chi   Math    Eng
c  False  False  False
a  False  False  False
b   True   True   True

In [109]:
frame[frame>5] = 0

In [110]:
frame

   Chi  Math  Eng
c    0     1    2
a    3     4    5
b    0     0    0

In [111]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)), index = ['a', 'b', 'c'], columns = ['A', 'B', 'C'])

In [112]:
frame

   A  B  C
a  0  1  2
b  3  4  5
c  6  7  8

In [113]:
frame.loc['b',['B','C']]

B    4
C    5
Name: b, dtype: int64

In [115]:
frame.iloc[1, [0,1]]

A    3
B    4
Name: b, dtype: int64

In [121]:
frame.iloc[:, 0:2][frame.A>2]

   A  B
b  3  4
c  6  7

In [123]:
data = pd.Series(np.arange(3), index = ['a', 'b', 'c'])

In [124]:
data

a    0
b    1
c    2
dtype: int64

In [126]:
data['b']

np.int64(1)

In [127]:
data2 = pd.Series(np.arange(3), index=[0,1,2])

In [128]:
data2

0    0
1    1
2    2
dtype: int64

In [135]:
data2.loc[1]

np.int64(1)

In [136]:
data2.iloc[1:2]

1    1
dtype: int64

In [137]:
s1 = pd.Series([1, 3, 5, 7], index= ['a', 'b', 'c', 'd'])

In [138]:
s2 = pd.Series([2, 4, 6, 8], index= ['a', 'd', 'e', 'f'])

In [140]:
s1

a    1
b    3
c    5
d    7
dtype: int64

In [141]:
s2

a    2
d    4
e    6
f    8
dtype: int64

In [142]:
s1+s2

a     3.0
b     NaN
c     NaN
d    11.0
e     NaN
f     NaN
dtype: float64

In [144]:
df1 = pd.DataFrame(np.arange(6).reshape(2,3), index=[1,2], columns=['a', 'b', 'c'])

In [145]:
df2 = pd.DataFrame(np.arange(6).reshape(3,2), index=[1,2,3], columns=['a', 'd'])

In [146]:
df1

   a  b  c
1  0  1  2
2  3  4  5

In [147]:
df2

   a  d
1  0  1
2  2  3
3  4  5

In [148]:
df1+df2

     a   b   c   d
1  0.0 NaN NaN NaN
2  5.0 NaN NaN NaN
3  NaN NaN NaN NaN

In [149]:
df2.loc[1,'a'] = np.nan

In [150]:
df2

     a  d
1  NaN  1
2  2.0  3
3  4.0  5

In [151]:
df1+df2

     a   b   c   d
1  NaN NaN NaN NaN
2  5.0 NaN NaN NaN
3  NaN NaN NaN NaN

In [152]:
df2.add(df1, fill_value=0)

     a    b    c    d
1  0.0  1.0  2.0  1.0
2  5.0  4.0  5.0  3.0
3  4.0  NaN  NaN  5.0

In [153]:
frame = pd.DataFrame(np.arange(12).reshape((3,4)), index=[1,2,3], columns=['a', 'b', 'c', 'd'])

In [154]:
frame

   a  b   c   d
1  0  1   2   3
2  4  5   6   7
3  8  9  10  11

In [155]:
series = frame.loc[1]

In [156]:
series

a    0
b    1
c    2
d    3
Name: 1, dtype: int64

In [157]:
frame - series

   a  b  c  d
1  0  0  0  0
2  4  4  4  4
3  8  8  8  8

In [158]:
series2 = pd.Series(np.arange(3), index=['b', 'd', 'e'])

In [159]:
series2

b    0
d    1
e    2
dtype: int64

In [160]:
frame+series2

    a    b   c     d   e
1 NaN  1.0 NaN   4.0 NaN
2 NaN  5.0 NaN   8.0 NaN
3 NaN  9.0 NaN  12.0 NaN

In [162]:
frame.sub(series2, axis=1)

    a    b   c     d   e
1 NaN  1.0 NaN   2.0 NaN
2 NaN  5.0 NaN   6.0 NaN
3 NaN  9.0 NaN  10.0 NaN

In [163]:
f = lambda x: x.max() - x.min()

In [164]:
frame.apply(f)

a    8
b    8
c    8
d    8
dtype: int64

In [166]:
frame.apply(f,axis=1)

1    3
2    3
3    3
dtype: int64

In [167]:
def f(x): return pd.Series([x.min(),x.max()], index=['min','max'])

In [168]:
frame.apply(f)

     a  b   c   d
min  0  1   2   3
max  8  9  10  11

In [172]:
obj = pd.Series(range(4), index=['b', 'd', 'c', 'a'])

In [173]:
obj

b    0
d    1
c    2
a    3
dtype: int64

In [174]:
obj.sort_index()

a    3
b    0
c    2
d    1
dtype: int64

In [176]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)), index=['b','a'], columns=['C', 'D', 'B', 'A'])

In [177]:
frame

   C  D  B  A
b  0  1  2  3
a  4  5  6  7

In [178]:
frame.sort_index(axis=1)

   A  B  C  D
b  3  2  0  1
a  7  6  4  5

In [180]:
frame.sort_index()

   C  D  B  A
a  4  5  6  7
b  0  1  2  3

In [181]:
frame.sort_index(axis=1, ascending=False)

   D  C  B  A
b  1  0  2  3
a  5  4  6  7

In [184]:
frame2 = pd.DataFrame({'a':[4,-3,5,1], 'b':[-2,6,3,4]})

In [185]:
frame2.sort_values(by='a')

   a  b
1 -3  6
3  1  4
0  4 -2
2  5  3

In [187]:
frame2.sort_values(by=['a','b'])

   a  b
1 -3  6
3  1  4
0  4 -2
2  5  3

In [188]:
obj = pd.Series([3, 1, -4, 8, 6])

In [189]:
obj

0    3
1    1
2   -4
3    8
4    6
dtype: int64

In [190]:
obj.rank()

0    3.0
1    2.0
2    1.0
3    5.0
4    4.0
dtype: float64

In [191]:
obj.rank(ascending=False, method='max')

0    3.0
1    4.0
2    5.0
3    1.0
4    2.0
dtype: float64

In [192]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'c', 'c'])

In [193]:
obj

a    0
a    1
b    2
c    3
c    4
dtype: int64

In [194]:
obj.index.is_unique

False

In [195]:
obj['a']

a    0
a    1
dtype: int64

In [196]:
obj = pd.Series(['a', 'b', 'b', 'b', 'c', 'a', 'c', 'c', 'c'])

In [197]:
obj.unique()

array(['a', 'b', 'c'], dtype=object)

In [199]:
obj.value_counts()

c    4
b    3
a    2
Name: count, dtype: int64

In [200]:
mask = obj.isin(['b','a'])

In [201]:
mask

0     True
1     True
2     True
3     True
4    False
5     True
6    False
7    False
8    False
dtype: bool